; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :action-costs :strips :typing)
  (:types
    phys_object location crate_type num container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    depot - location


    n0 n1 n2 n3 n4 - num
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - num)

    (next ?numA - num ?numB - num)
    )

  (:functions
    (total-cost) - number
    (fly-cost ?from - location ?to - location) - number
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    (increase (total-cost) (fly-cost ?from ?to))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    (increase (total-cost) 10)
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    (increase (total-cost) 10)
    )
   )

  (:action load_crate_on_carrier
   :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
   :precondition
   (and
    (at ?h ?l)
    (at ?r ?l)
    (contains ?h ?c)
    (nb_loaded_crates ?r ?nb_loaded)
    (next ?nb_loaded ?new_nb_loaded)
    )
   :effect
   (and
     (not (nb_loaded_crates ?r ?nb_loaded))
     (nb_loaded_crates ?r ?new_nb_loaded)
     (not (contains ?h ?c))
     (contains ?r ?c)
     (increase (total-cost) 10)
     (empty ?h)
     )
   )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?from)) (at ?h ?to)
      (not (at ?r ?from)) (at ?r ?to)
      (increase (total-cost) (fly-cost ?from ?to))
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (not (empty ?h))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      (increase (total-cost) 10)
      )
    )
  )

; problem
(define (problem helicopter_problem_1_1_3_10_10c2c8_5)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	loc1 - location
	loc2 - location
	loc3 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	carrier1 - carrier
)
(:init
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
	(= (total-cost) 0)
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 medicine_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 medicine_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 medicine_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(is_type crate6 medicine_crate)
	(at crate6 depot)
	(can_be_taken crate6)
	(is_type crate7 medicine_crate)
	(at crate7 depot)
	(can_be_taken crate7)
	(is_type crate8 medicine_crate)
	(at crate8 depot)
	(can_be_taken crate8)
	(is_type crate9 medicine_crate)
	(at crate9 depot)
	(can_be_taken crate9)
	(is_type crate10 medicine_crate)
	(at crate10 depot)
	(can_be_taken crate10)
	(at helicopter1 depot)
	(empty helicopter1)
	(at person1 loc1)
	(at person2 loc2)
	(at person3 depot)
	(at person4 loc2)
	(at person5 depot)
	(at person6 loc1)
	(at person7 depot)
	(at person8 loc1)
	(at person9 loc1)
	(at person10 depot)
	(at carrier1  depot)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 172)
	(= (fly-cost depot loc2) 179)
	(= (fly-cost depot loc3) 164)
	(= (fly-cost loc1 depot) 172)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 181)
	(= (fly-cost loc1 loc3) 49)
	(= (fly-cost loc2 depot) 179)
	(= (fly-cost loc2 loc1) 181)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 134)
	(= (fly-cost loc3 depot) 164)
	(= (fly-cost loc3 loc1) 49)
	(= (fly-cost loc3 loc2) 134)
	(= (fly-cost loc3 loc3) 1)
)
(:goal (and

	(at helicopter1 depot)
	(has_crate person1 medicine_crate)
	(has_crate person2 food_crate)
	(has_crate person4 medicine_crate)
	(has_crate person5 food_crate)
	(has_crate person5 medicine_crate)
	))
(:metric minimize (total-cost))
)

; plan
1. (pick_up helicopter1 crate4 depot)
   deleted: (empty helicopter1) (can_be_taken crate4) (at crate4 depot)
   added: (contains helicopter1 crate4)
   goals met: 1 of 6
2. (give helicopter1 crate4 person5 depot medicine_crate)
   deleted: (contains helicopter1 crate4)
   added: (empty helicopter1) (can_be_taken crate4) (has_crate person5 medicine_crate)
   goals met: 2 of 6
3. (pick_up helicopter1 crate2 depot)
   deleted: (empty helicopter1) (can_be_taken crate2) (at crate2 depot)
   added: (contains helicopter1 crate2)
   goals met: 2 of 6
4. (give helicopter1 crate2 person5 depot food_crate)
   deleted: (contains helicopter1 crate2)
   added: (empty helicopter1) (can_be_taken crate2) (has_crate person5 food_crate)
   goals met: 3 of 6
5. (pick_up helicopter1 crate3 depot)
   deleted: (empty helicopter1) (can_be_taken crate3) (at crate3 depot)
   added: (contains helicopter1 crate3)
   goals met: 3 of 6
6. (move helicopter1 depot loc1)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc1)
   goals met: 2 of 6
7. (give helicopter1 crate3 person1 loc1 medicine_crate)
   deleted: (contains helicopter1 crate3)
   added: (empty helicopter1) (can_be_taken crate3) (has_crate person1 medicine_crate)
   goals met: 3 of 6
8. (move helicopter1 loc1 depot)
   deleted: (at helicopter1 loc1)
   added: (at helicopter1 depot)
   goals met: 4 of 6
9. (pick_up helicopter1 crate1 depot)
   deleted: (empty helicopter1) (can_be_taken crate1) (at crate1 depot)
   added: (contains helicopter1 crate1)
   goals met: 4 of 6
10. (move helicopter1 depot loc2)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc2)
   goals met: 3 of 6
11. (give helicopter1 crate1 person2 loc2 food_crate)
   deleted: (contains helicopter1 crate1)
   added: (empty helicopter1) (can_be_taken crate1) (has_crate person2 food_crate)
   goals met: 4 of 6
12. (move helicopter1 loc2 depot)
   deleted: (at helicopter1 loc2)
   added: (at helicopter1 depot)
   goals met: 5 of 6
13. (pick_up helicopter1 crate6 depot)
   deleted: (empty helicopter1) (can_be_taken crate6) (at crate6 depot)
   added: (contains helicopter1 crate6)
   goals met: 5 of 6
14. (move helicopter1 depot loc2)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc2)
   goals met: 4 of 6
15. (give helicopter1 crate6 person4 loc2 medicine_crate)
   deleted: (contains helicopter1 crate6)
   added: (empty helicopter1) (can_be_taken crate6) (has_crate person4 medicine_crate)
   goals met: 5 of 6
16. (move helicopter1 loc2 depot)
   deleted: (at helicopter1 loc2)
   added: (at helicopter1 depot)
   goals met: 6 of 6
